In [2]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

In [3]:
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

In [ ]:
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])
# df['job_skills'] = df['job_skills'].apply(lambda skill_list: ast.literal_eval(skill_list) if pd.notna(skill_list) else skill_list)

In [7]:
df[pd.notna(df['salary_year_avg'])]['salary_year_avg']

28        109500.0
77        140000.0
92        120000.0
100       228222.0
109        89000.0
            ...
785624    139216.0
785641    150000.0
785648    221875.0
785682    157500.0
785692    157500.0
Name: salary_year_avg, Length: 22003, dtype: float64

Creating a function

In [8]:
def projected_salary(salary):
    return salary * 1.03

In [11]:
df_salary = df[pd.notna(df['salary_year_avg'])].copy()
df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(projected_salary)
df_salary[['salary_year_avg','salary_year_inflated']]

        salary_year_avg  salary_year_inflated
28             109500.0             112785.00
77             140000.0             144200.00
92             120000.0             123600.00
100            228222.0             235068.66
109             89000.0              91670.00
...                 ...                   ...
785624         139216.0             143392.48
785641         150000.0             154500.00
785648         221875.0             228531.25
785682         157500.0             162225.00
785692         157500.0             162225.00

[22003 rows x 2 columns]

Using an anonymous function

In [ ]:
'''
df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(lambda salary: salary * 1.03)
'''

**Applying a fucntion to the job skills**

change from string to list

In [16]:
df['job_skills'][1]

"['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']"

In [ ]:
# Converting value to list
import ast
ast.literal_eval(df['job_skills'][2])

['python',
 'sql',
 'c#',
 'azure',
 'airflow',
 'dax',
 'docker',
 'kubernetes',
 'jenkins']

In [ ]:
def clean_list(skill_list):
    if pd.notna(skill_list): # checks if value is not non-value
        return ast.literal_eval(skill_list)

df['job_skills'] = df['job_skills'].apply(clean_list)

'''  
# As lambda
df['job_skills'] = df['job_skills'].apply(lambda skill_list: ast.literal_eval(skill_list) if pd.notna(skill_list) else skill_list)
'''

In [22]:
print(df['job_skills'][2])
type(df['job_skills'][2])

['python', 'sql', 'c#', 'azure', 'airflow', 'dax', 'docker', 'kubernetes', 'jenkins']

list

Multiple projections
Senior roles assume 5%
Other roles assume 3%

In [27]:
def projected_salary(row):
    if "Senior" in row['job_title_short']:
        return 1.05 * row['salary_year_avg']
    else:
        return 1.03 * row['salary_year_avg']

df_salary['salary_year_inflated'] = df_salary.apply(projected_salary, axis=1)

df_salary[['job_title_short', 'salary_year_avg', 'salary_year_inflated']].sample(20)

              job_title_short  salary_year_avg  salary_year_inflated
468158          Data Engineer         133000.0            136990.000
434060         Data Scientist         190000.0            195700.000
300090          Data Engineer         127500.0            131325.000
483160           Data Analyst          65000.0             66950.000
724101      Software Engineer         205000.0            211150.000
520737           Data Analyst         175000.0            180250.000
477846         Data Scientist          69962.5             72061.375
386611          Data Engineer         101737.0            104789.110
726387           Data Analyst         130000.0            133900.000
335511    Senior Data Analyst          95000.0             99750.000
480960           Data Analyst          70000.0             72100.000
229088          Data Engineer          90000.0             92700.000
559068           Data Analyst         112050.0            115411.500
734530  Senior Data Scientist         157500.0            165375.000
619949         Data Scientist         140062.5            144264.375
14481     Senior Data Analyst         149000.0            156450.000
217288           Data Analyst          72500.0             74675.000
664250         Data Scientist         146500.0            150895.000
728111           Data Analyst         122500.0            126175.000
758545      Software Engineer         156000.0            160680.000